[{"id":1974,"level":46,"kanji":"俵","onyomi":[{"reading":"ひょう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"たわら","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Sack","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>leader</radical> of your sad <radical>life</radical> aims a <radical>kick</radical> at the <kanji>sack</kanji> you are holding. This leader is in charge of making your life sad. The next step in the leader making your life suck is attempting to kick your sack out of your hands. Your sack holds all your valuables, so it's not something you want to have kicked.","meaning_hint":"See this leader's kick coming at your sack. Hear the leader yelling as he aims his kick at your sack. Hiyahhh! Also keep in mind that the life radical is missing the little drop/slide thing on the side. It's missing that because your life is lousy and sad.","reading_mnemonic":"You manage to get your <kanji>sack</kanji> out of the way as you shout \"<reading>Heyo</reading> (ひょう)! Look, you missed! Heyo!\" Unfortunately your leader's friend was standing behind you and he kicks your sack as you move it out of the way. \"Heyo!\" he shouts, mockingly.","reading_hint":"You thought you were all cool saying \"heyo\" and moving your sack away from the kick, but they had this planned all along. Heyo…","vocabulary":[{"word":"土俵","level":46,"meaning":"Ring","reading":"どひょう"},{"word":"土俵際","level":48,"meaning":"Edge Of A Sumo Ring","reading":"どひょうぎわ"}]},{"id":1949,"level":46,"kanji":"吾","onyomi":[{"reading":"ご","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"わが","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"I","primary":true,"accepted_answer":true},{"meaning":"Me","primary":false,"accepted_answer":true}],"meaning_mnemonic":"I have <radical>five</radical> things in my <radical>mouth</radical> and <kanji>I</kanji> need them all for <kanji>me</kanji>. I own these five things, and I keep them in my mouth so people like you cannot take them from me.","meaning_hint":"What five things would you keep in your mouth to protect them from me? Imagine these five things in your mouth and think of how important they are to you as you taste them on your tongue.","reading_mnemonic":"<kanji>Me</kanji>, personally, <kanji>I</kanji> am quite thirsty so I ask for some “<reading>waga</reading>” (わが). I have five things in my mouth, so it is hard for me to pronounce the word “water”. So it sounds like “waga” when I ask for it. “Coulg I pweash hab sum waga?! I deed waga!!”","reading_hint":"Imagine how you would sound asking for “waga” with your mouth full of five things. You can carry out this experiment in real life if you would like, just be careful not to choke, okay?","vocabulary":[{"word":"吾輩","level":46,"meaning":"I","reading":"わがはい"}]},{"id":2119,"level":46,"kanji":"孔","onyomi":[{"reading":"こう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"あな","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Cavity","primary":true,"accepted_answer":true},{"meaning":"Hole","primary":false,"accepted_answer":true}],"meaning_mnemonic":"You see a <radical>child</radical> with an <radical>umbrella</radical> in front of you. Suddenly, they fall straight down into a <kanji>cavity</kanji> in the road. It's a big <kanji>hole</kanji>!","meaning_hint":"You run over to where the child fell. They are just fine! Because they had an umbrella, they were able to float to the bottom.","reading_mnemonic":"\"Into my <kanji>cavity</kanji> you go!\" yells a voice. It is <reading>こう</reading>いち. ","reading_hint":"\"You will stay in that cavity or hole until you repent.\" If it hasn't been clear up until now, Emperor こういち is going mad with power.","vocabulary":[{"word":"瞳孔","level":46,"meaning":"Pupil","reading":"どうこう"},{"word":"眼孔","level":46,"meaning":"Eye Socket","reading":"がんこう"}]},{"id":1951,"level":46,"kanji":"寧","onyomi":[{"reading":"ねい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"むし","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Rather","primary":true,"accepted_answer":true}],"meaning_mnemonic":"On the <radical>roof</radical> is your <radical>heart</radical>. OR! In a <radical>net</radical> in the <radical>street</radical>. Which would you <kanji>rather</kanji>?","meaning_hint":"Would you rather have your heart up on the roof, close to falling but out of the way of people. Or would you rather have your heart in a net, which people can't steal from, but is in the way of cars.","reading_mnemonic":"As you try to decide which you'd <kanji>rather</kanji> have, your <reading>neigh</reading>bors (ねい) come out and grab the heart out of your hands.","reading_hint":"\"I'd rather you didn't have that!\" you shout as your neighbors run through the neighborhood to their own house. You'd rather this wasn't happening! You'd rather your neighbors let you make your own choice!!","vocabulary":[{"word":"寧ろ","level":46,"meaning":"Rather","reading":"むしろ"},{"word":"丁寧","level":46,"meaning":"Polite","reading":"ていねい"}]},{"id":1946,"level":46,"kanji":"寮","onyomi":[{"reading":"りょう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Dormitory","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You need to bring <radical>charcoal</radical> under this <radical>roof</radical> to heat the <kanji>dormitory</kanji>. You live in this dormitory with a bunch of other kids, and you all have to take turns bringing in the charcoal from outside to heat it.","meaning_hint":"Imagine looking at a dormitory chore wheel and seeing it's your turn to carry in the charcoal this week. Bleh!","reading_mnemonic":"The <kanji>dormitory</kanji> is on an island, so when you go out to get the charcoal you have to take a <reading>row</reading> (りょう) boat. You row and row and row until you reach the shed with all the charcoal. Then you row and row and row it back to the dormitory.","reading_hint":"The dormitory row boat leaks a little too, so by the time you get back you really need to light the charcoal and heat up!","vocabulary":[{"word":"寮生","level":46,"meaning":"Boarding Student","reading":"りょうせい"}]},{"id":1967,"level":46,"kanji":"帝","onyomi":[{"reading":"てい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"みかど","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Sovereign","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You <radical>stand</radical> your <radical>towel</radical> up so everyone can see it. This announces that you are the <kanji>sovereign</kanji> ruler of this bathroom.","meaning_hint":"Whenever someone walks into your bathroom, you start screaming that you are the sovereign ruler of this toilet, this sink, this toothbrush, and all that touch these tiles.","reading_mnemonic":"As the <kanji>sovereign</kanji> ruler of this bathroom, you must choose a monogram to represent your rule. For this, you choose the symbol of the food that passes through you the most: The mighty <reading>ta</reading>ter (てい) tot!","reading_hint":"Picture your standing towel with a huge tater tot sewn into it. Everyone who sees this will know that you're the toilet tater tot sovereign.","vocabulary":[{"word":"皇帝","level":46,"meaning":"Emperor","reading":"こうてい"},{"word":"帝国","level":46,"meaning":"Empire","reading":"ていこく"},{"word":"帝政","level":46,"meaning":"Imperial Government","reading":"ていせい"},{"word":"帝国主義","level":48,"meaning":"Imperialism","reading":"ていこくしゅぎ"}]},{"id":1961,"level":46,"kanji":"幽","onyomi":[{"reading":"ゆう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Secluded","primary":true,"accepted_answer":true}],"meaning_mnemonic":"<radical>Poop</radical> <radical>Poop</radical> <radical>Mountain</radical> is covered in poop because it is such a <kanji>secluded</kanji> place.","meaning_hint":"A secluded place has no toilets, so you just poop right on the mountain.","reading_mnemonic":"The <kanji>secluded</kanji> Poop Poop Mountain is a favorite of <reading>you</reading>ths (ゆう). They go there to get away from their phones to get in touch with nature again. ","reading_hint":"Imagine hundreds of youths on this secluded mountain, all pooping on the ground while trying to get a cell phone signal.","vocabulary":[{"word":"幽閉","level":46,"meaning":"Confinement","reading":"ゆうへい"},{"word":"幽霊","level":46,"meaning":"Ghost","reading":"ゆうれい"}]},{"id":1971,"level":46,"kanji":"庄","onyomi":[{"reading":"しょう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Manor","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You're standing under a <radical>canopy</radical> when you see something strange sticking out of the <radical>dirt</radical>. You pull it, but it won't budge. You pull harder and harder until the dirt starts rumbling and a giant <kanji>manor</kanji> starts rising out of the ground with you on top!","meaning_hint":"Picture yourself on top of this manor that rose out of the ground. The canopy is still above you and it seems to be attached to the roof.","reading_mnemonic":"The beautiful <kanji>manor</kanji> begins to shake and the <reading>shou</reading>gun (しょう) bursts out of the front door. \"WHO HAS UNEARTHED MY SECRET MANOR?!\" he screams.","reading_hint":"Imagine being chased by an angry shougun all through his giant, luxurious manor. You barely have time to admire the interior design with him gaining on you like this!","vocabulary":[{"word":"庄園","level":46,"meaning":"Manor","reading":"しょうえん"}]},{"id":1950,"level":46,"kanji":"斬","onyomi":[{"reading":"ざん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"き","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Slice","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You use your <radical>car</radical> and an <radical>axe</radical> to <kanji>slice</kanji> down a pedestrian. This innocent guy is just walking along the road when you drive up to him in your car and axe him to death with your axe. You’re all like, VROOM! AXE! Now this guy is dead because you sliced him down in cold blood.","meaning_hint":"Imagine driving your car, waving your axe out the window and slicing this guy down. Hear his scream ring in your ears as you slice, slice, SLICE.","reading_mnemonic":"You were driving around in <reading>Zan</reading>zibar (ざん) when you <kanji>slice</kanji>d down this man. Luckily, Zanzibar has no laws at all, so you won’t get arrested for slicing down this guy with your axe.","reading_hint":"Zanzibar is a crazy place, huh? Continue to drive around Zanzibar as you wave your axe out your car window looking for another victim to slice.","vocabulary":[{"word":"斬新","level":46,"meaning":"Novel Idea","reading":"ざんしん"},{"word":"斬殺","level":46,"meaning":"Killing With A Sword","reading":"ざんさつ"},{"word":"斬る","level":46,"meaning":"To Cut Down","reading":"きる"}]},{"id":1976,"level":46,"kanji":"架","onyomi":[{"reading":"か","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"か","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Shelf","primary":true,"accepted_answer":true}],"meaning_mnemonic":"With the <radical>power</radical> of your <radical>mouth</radical> you command a <radical>tree</radical> to become a <kanji>shelf</kanji>. Most of the time one would have to use their hands and tools to turn a tree into a shelf, but you are capable of turning a tree into a shelf by using the power of your mouth.","meaning_hint":"Imagine using your mouth to turn a tree into a shelf. Yell at this tree and keep yelling at it until you see it become a shelf.","reading_mnemonic":"Once you turn the tree into a <kanji>shelf</kanji> you put the shelf in your <reading>ca</reading>r (か) and sell it at a local pawn shop. You keep doing this over and over again until you are rich. You command the trees to turn into shelves and then you take the shelves in your car to sell them. Easy money.","reading_hint":"Imagine transporting the shelves in your car. Over and over. Back and forth in your car. Vroom vroom.","vocabulary":[{"word":"架設","level":46,"meaning":"Construction","reading":"かせつ"},{"word":"書架","level":46,"meaning":"Bookshelf","reading":"しょか"},{"word":"担架","level":46,"meaning":"Stretcher","reading":"たんか"}]},{"id":1948,"level":46,"kanji":"棟","onyomi":[{"reading":"とう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"むね","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"むな","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Building","primary":true,"accepted_answer":true},{"meaning":"Ridge","primary":false,"accepted_answer":true}],"meaning_mnemonic":"There’s a <radical>tree</radical> in the <radical>east</radical> that looks like a <kanji>building</kanji>. The tree is tall and straight and doesn't have any leaves or branches. It's basically a big wooden building.","meaning_hint":"Look at this big tree building over in the east. Imagine actually using it as a building and moving in. And why not? It's free real estate.","reading_mnemonic":"That <kanji>building</kanji> happens to be in the center of <reading>とう</reading>きょう. If you need to find east (which is where とうきょう is), you just look for the building.","reading_hint":"Imagine looking down on とうきょう from the top floor of this magnificent building you've just moved into. The sun is rising behind you, slowly illuminating the city below.","vocabulary":[{"word":"病棟","level":46,"meaning":"Hospital Ward","reading":"びょうとう"}]},{"id":1952,"level":46,"kanji":"椅","onyomi":[{"reading":"い","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Chair","primary":true,"accepted_answer":true}],"meaning_mnemonic":"This <radical>tree</radical> is very <radical>odd</radical>, to say the least. The shape is all crazy, like a lightning bolt stuck into the ground, or something. Oh wait, look at this. I can sit on it really nicely. It's just like a <kanji>chair</kanji>!","meaning_hint":"Imagine this odd tree <kanji>chair</kanji> being the most comfortable chair you've ever sat on. It's shaped perfectly for you, and the moss makes it soft. Wow, what a chair.","reading_mnemonic":"But, this odd tree <kanji>chair</kanji> is also home to an <reading>ea</reading>gle (い). It swoops down upon you as you sit down, gouging your eyes out.","reading_hint":"Feel the fear and regret. You should have known not to sit in this \"chair\". Mother nature never forgives, and now you don't have eyeballs.","vocabulary":[{"word":"椅子","level":46,"meaning":"Chair","reading":"いす"},{"word":"車椅子","level":48,"meaning":"Wheelchair","reading":"くるまいす"}]},{"id":1953,"level":46,"kanji":"歳","onyomi":[{"reading":"さい","primary":true,"accepted_answer":true,"type":"onyomi"},{"reading":"せい","primary":false,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Years Old","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You need to <radical>stop</radical> a <radical>drunkard</radical> from going down a <radical>slide</radical> with a <radical>jackhammer</radical> to ask him how many <kanji>years old</kanji> he is. He's doing a lot of dangerous things right now, and they all have age limits.","meaning_hint":"Depending how many years old he is, this guy could be violating like three different laws right now.","reading_mnemonic":"When you ask him how many <kanji>years old</kanji> he is, he turns to you and screams, \"I'M A MILLION YEARS OLD AND YOU'LL NEVER STOP ME!\" That's obviously not how old this kid is, so you take out your holy blue <reading>sa</reading>ber (せい) and slice the slide in half. Then the jackhammer. Then the kid's metal arm—wait! This kid is a <reading>cy</reading>borg (さい)!","reading_hint":"Your saber cuts through the cyborgs robo-body and it screams, \"OKAY OKAY I'M NOT A MILLION I'M ONLY FIVE YEARS OLD AND A CYBORG PLEASE DON'T REPROGRAM ME!\"","vocabulary":[{"word":"歳月","level":46,"meaning":"Time","reading":"さいげつ"},{"word":"〜歳","level":46,"meaning":"Years Old","reading":"さい"},{"word":"二十歳","level":46,"meaning":"Twenty Years Old","reading":"はたち"},{"word":"万歳","level":46,"meaning":"Banzai","reading":"ばんざい"},{"word":"歳暮","level":46,"meaning":"End Of The Year","reading":"せいぼ"},{"word":"歳入","level":46,"meaning":"Annual Revenue","reading":"さいにゅう"}]},{"id":1962,"level":46,"kanji":"泡","onyomi":[{"reading":"ほう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"あわ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Bubbles","primary":true,"accepted_answer":true}],"meaning_mnemonic":"If a <radical>tsunami</radical> <radical>wrap</radical>s around itself, the resulting wave will create a lot of <kanji>bubbles</kanji>. You know how tsunamis wrap around once gravity kicks in, right? Well when that wave crashes, a whole lot of bubbles are created.","meaning_hint":"Picture the bubbles bursting out of the wrapped up tsunami as it crashes down. The air that the tsunami sucked in while it was wrapping up come out as bubbles big and small.","reading_mnemonic":"One of the biggest <kanji>bubbles</kanji> heads straight for your <reading>ho</reading>me (ほう), engulfs it, and picks it up into the air!","reading_hint":"Watch helplessly as your home, now trapped in a bubble, floats away into the sky.","vocabulary":[{"word":"気泡","level":46,"meaning":"Air Bubble","reading":"きほう"},{"word":"水泡","level":46,"meaning":"Foam","reading":"すいほう"},{"word":"発泡","level":46,"meaning":"Foaming","reading":"はっぽう"}]},{"id":1973,"level":46,"kanji":"黙","onyomi":[{"reading":"もく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"だま","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Shut Up","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Your village wants to take the <radical>village</radical> <radical>dog</radical> and <radical>boil</radical> it, and you can think of no other response than <kanji>SHUT UP</kanji>! ","meaning_hint":"The entire village is shouting and yelling and pointing at the poor dog. They're boiling a giant boiling pot of water, and you can't even hear yourself think anymore. Shut up, shut up, shut up! ","reading_mnemonic":"The villagers are mad that you told them to <kanji>shut up</kanji>, and they start to <reading>mock</reading> (もく) you. They put their hands on their hips, lean forward, cross their eyes, and yell \"SHUT UP!\" back.","reading_hint":"Even the dog is mocking you now. It's barks sound more like \"shut up, shut up\" than \"bow wow, bow wow.\" What the heck dog, I was trying to save your life!","vocabulary":[{"word":"黙る","level":46,"meaning":"To Shut Up","reading":"だまる"},{"word":"沈黙","level":46,"meaning":"Silence","reading":"ちんもく"},{"word":"黙殺","level":46,"meaning":"Ignoring","reading":"もくさつ"},{"word":"寡黙","level":60,"meaning":"Silent","reading":"かもく"}]},{"id":1955,"level":46,"kanji":"猿","onyomi":[{"reading":"えん","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"さる","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Monkey","primary":true,"accepted_answer":true}],"meaning_mnemonic":"An <radical>animal</radical> that <radical>kick</radical>s <radical>dirt</radical> into people's <radical>mouth</radical>s is a <kanji>monkey</kanji>. Monkeys are naughty little things. You should be happy it was just dirt it kicked into your mouth, and not something worse.","meaning_hint":"Imagine looking at a monkey at the zoo. Aww, it's so cute. But then it turns around and kicks some dirt right into your aww-ing mouth. Yuck! Why monkey, why?!","reading_mnemonic":"You spit the dirt out of your mouth and look back at the <kanji>monkey</kanji> to see that it's <reading>salu</reading>ting (さる) you. Is... is it mocking you?","reading_hint":"Picture the monkey saluting you as you spit dirt out of your mouth. Taste the bitter dirt and the bitter shame. You were played by a monkey.","vocabulary":[{"word":"猿真似","level":46,"meaning":"Monkey See Monkey Do","reading":"さるまね"}]},{"id":1963,"level":46,"kanji":"癖","onyomi":[{"reading":"へき","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"くせ","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Habit","primary":true,"accepted_answer":true}],"meaning_mnemonic":"When you get <radical>sick</radical> you always eat a <radical>hot pepper</radical>. It's a <kanji>habit</kanji> you've picked up and you can't seem to shake it. One sniffle, one cough, and before you know it, you're eating a hot pepper or two.","meaning_hint":"Imagine if you had a habit of eating hot peppers whenever you thought you might be getting sick. To be fair, it flushes out your sinuses and tastes good, so it's not the worst habit you could have.","reading_mnemonic":"Everyone you know has a different <kanji>habit</kanji> when they get sick. Instead, they eat <reading>cous</reading>cous (くせ). But you think couscous is gross. It's bland and does nothing for your stuffy noses and scratchy throats. I wonder how you can convince them to replace their habit with your own.","reading_hint":"Unfortunately, now you've gotten into the habit of telling everyone what to do when they get sick. \"Yeah, yeah, eat a hot pepper, we know. But couscous is better,\" they say before you can speak. To each their own, I suppose.","vocabulary":[{"word":"口癖","level":46,"meaning":"Favorite Phrase","reading":"くちぐせ"},{"word":"癖に","level":48,"meaning":"And Yet","reading":"くせに"}]},{"id":1947,"level":46,"kanji":"盆","onyomi":[{"reading":"ぼん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Tray","primary":true,"accepted_answer":true},{"meaning":"Ancestral Festival","primary":false,"accepted_answer":true}],"meaning_mnemonic":"You put <radical>part</radical> of your food on a <radical>plate</radical>, then put that on a <kanji>tray</kanji> to keep it safe. This tray is an offering for the <kanji>ancestral festival</kanji>, where your ancestors' spirits visit you to check in and share some of that food you're offering on a tray.","meaning_hint":"Imagine preparing this tray, just before your ancestors arrive in friendly ghost form to share part of your meal with you. They only come once a year, so make sure it's a nice tray, okay?","reading_mnemonic":"The plate you put on the <kanji>tray</kanji> for the <kanji>ancestral festival</kanji> is made of <reading>bone</reading> (ぼん). Bone china, that is. How fancy… And appropriate, considering bone china is made from actual bone.","reading_hint":"Tap the bone china plate with your knuckle bone. Hear the pleasant clink it makes as you set it on the tray.","vocabulary":[{"word":"お盆","level":46,"meaning":"Tray","reading":"おぼん"},{"word":"盆踊り","level":48,"meaning":"Ancestral Festival Dance","reading":"ぼんおどり"},{"word":"盆栽","level":54,"meaning":"Bonsai","reading":"ぼんさい"}]},{"id":1968,"level":46,"kanji":"瞬","onyomi":[{"reading":"しゅん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"またた","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"まばた","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Blink","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Your <radical>eye</radical> gets kicked with a <radical>cleat</radical> that came careening toward your <radical>forehead</radical> when it popped off someone doing a <radical>dance</radical>, and you <kanji>blink</kanji>.","meaning_hint":"Well, of course you blink, you can't control that. And when a cleat come hurtling toward your eye it blinks automatically.","reading_mnemonic":"You <kanji>blink</kanji> and blink and <reading>soon</reading> (しゅん) there are tears coming out of them too. You try to blink them away but it's not working. Soon you're crying and blinking and crying some more.","reading_hint":"Soon the person who's cleat hit you is running over and trying to apologize and stop your crying, but it's too late.","vocabulary":[{"word":"瞬く","level":46,"meaning":"To Blink","reading":"またたく"},{"word":"瞬間","level":46,"meaning":"An Instant","reading":"しゅんかん"},{"word":"瞬時","level":46,"meaning":"Moment","reading":"しゅんじ"},{"word":"瞬き","level":46,"meaning":"A Blink","reading":"まばたき"},{"word":"一瞬","level":46,"meaning":"An Instant","reading":"いっしゅん"}]},{"id":1956,"level":46,"kanji":"瞳","onyomi":[{"reading":"どう","primary":true,"accepted_answer":true,"type":"onyomi"},{"reading":"とう","primary":false,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ひとみ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Pupil","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Inside your <radical>eye</radical> <radical>stand</radical>s a tiny <radical>village</radical> that makes up your <kanji>pupil</kanji>. That's the black part of your eye!","meaning_hint":"Oh, did you think your pupil was a hole? No, no, you misunderstand. That's where the village stands. It's full of little people who whisper to your brain what you should see.","reading_mnemonic":"All of the people in your <kanji>pupil</kanji> eat <reading>dou</reading>ghnuts (どう) all day long. That's why your eye is shaped like a doughnut, with the \"hole\" (village) as their home.","reading_hint":"Even if you're a pupil non-believer, at least you can see how it's shaped like a doughnut hole, right?","vocabulary":[{"word":"瞳孔","level":46,"meaning":"Pupil","reading":"どうこう"}]},{"id":1959,"level":46,"kanji":"碁","onyomi":[{"reading":"ご","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Go","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>crab</radical> moves a <radical>stone</radical> because he is playing the game <kanji>Go</kanji>. You know this game, right? You put black or white stones on a board until you win the game. This is the Japanese game known as Go. This crab is pretty good.","meaning_hint":"Look at this crab placing stones on the Go board. Hear them click and clack as the crab places them with expert precision.","reading_mnemonic":"<kanji>Go</kanji> is pronounced <reading>Go</reading> (ご) in Japanese, too. How convenient is that? Like, super convenient. So easy even a crab could remember!","reading_hint":"Go is Go. Easy!","vocabulary":[{"word":"囲碁","level":46,"meaning":"Go","reading":"いご"},{"word":"碁盤","level":46,"meaning":"Go Board","reading":"ごばん"},{"word":"碁会所","level":46,"meaning":"Go Parlor","reading":"ごかいしょ"}]},{"id":1960,"level":46,"kanji":"租","onyomi":[{"reading":"そ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Tariff","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Someone with a <radical>top hat</radical> comes and tells you that your <radical>grain</radical>s are going to be taxed from now on. Top hat man says there is a <kanji>tariff</kanji> that's been enacted on grains. Rice? Triple the price. Wheat? Quadruple.","meaning_hint":"People in top hats like to put tariffs on lots of things. Especially things you need, like grains you eat to stay alive. You have no choice but to pay.","reading_mnemonic":"You're listening to all the things in this <kanji>tariff</kanji> and you finally get fed up and ask what isn't being taxed now. The top hat man looks at you and smiles, holding out his hand. In his hand is some <reading>soa</reading>p (そ).","reading_hint":"Everything you get from other counties has been tariffed except for soap. You'll be hungry, but at least you'll be clean.","vocabulary":[{"word":"租界","level":46,"meaning":"Concession","reading":"そかい"},{"word":"租税","level":46,"meaning":"Taxes","reading":"そぜい"}]},{"id":1966,"level":46,"kanji":"穂","onyomi":[{"reading":"すい","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"ほ","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Head of Plant","primary":true,"accepted_answer":true},{"meaning":"Ear Of Plant","primary":false,"accepted_answer":true}],"meaning_mnemonic":"The part of the <radical>grain</radical> people <radical>favor</radical> the most is the <kanji>head of the plant</kanji>. You don't eat the stems and leaves of rice or wheat plants, right? You eat the head where the grains are.","meaning_hint":"Imagine yourself walking through a field of rice plants. Now look very closely at the head of the plant in front of you. See the rice bunched up there? That's the good stuff.","reading_mnemonic":"When you want to harvest the <kanji>head of the plant</kanji> you'd like to eat, you need to use a <reading>hoe</reading> (ほ). Using a hoe, you can dig up the bottom of the plant without injuring the head.","reading_hint":"Imagine working in a field of rice and using a hoe so you don't injure the head of the plant. You're sweating and it's hot, but you keep at it.","vocabulary":[{"word":"稲穂","level":46,"meaning":"Head Of Rice","reading":"いなほ"}]},{"id":1943,"level":46,"kanji":"穏","onyomi":[{"reading":"おん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"おだ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Calm","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Some <radical>grains</radical> get stuck in his <radical>cleat</radical>, and <radical>Wolverine</radical>'s <radical>heart</radical> grows <kanji>calm</kanji>. Wolverine had been screaming and yelling and stomping around, but when the grains entered his cleat he realized where he was. He was finally able to calm down.","meaning_hint":"He's calm now because he stomped right into a farmer's field (thus the rice) and if he didn't calm down he'd probably ruin it.","reading_mnemonic":"Now that Wolverine is <kanji>calm</kanji>, tears come to his eyes. Being calm has given him perspective on what his anger has done. Oh, wait no. There are just some <reading>on</reading>ions (おん) in his cleats too, and they're making calm tears trickle down his eyes.","reading_hint":"Picture Wolverine sitting calmly in this field, onions causing tears to stream down his cheeks as he reflects on what he's done.","vocabulary":[{"word":"穏やか","level":46,"meaning":"Calm","reading":"おだやか"},{"word":"穏当","level":46,"meaning":"Proper","reading":"おんとう"},{"word":"平穏","level":46,"meaning":"Calm","reading":"へいおん"},{"word":"不穏","level":46,"meaning":"Unrest","reading":"ふおん"}]},{"id":1975,"level":46,"kanji":"綿","onyomi":[{"reading":"めん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"わた","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Cotton","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>white</radical> <radical>thread</radical> in your <radical>towel</radical> comes from <kanji>cotton</kanji>. We use cotton to make lots of things, like clothes and bedsheets. But white towels are always made from soft, fluffy cotton.","meaning_hint":"Imagine shoving your face into a nice, clean, white cotton towel. Mmm, so fresh.","reading_mnemonic":"This <kanji>cotton</kanji> is made by <reading>men</reading> (めん).","reading_hint":"Picture all of the men lined up, making towels out of pure white cotton. They're all rubbing their faces in the soft cotton whenever they can.","vocabulary":[{"word":"綿布","level":46,"meaning":"Cotton Cloth","reading":"めんぷ"},{"word":"木綿","level":46,"meaning":"Cotton","reading":"もめん"}]},{"id":1969,"level":46,"kanji":"菊","onyomi":[{"reading":"きく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Chrysanthemum","primary":true,"accepted_answer":true}],"meaning_mnemonic":"If you pick the wrong kind of <radical>flowers</radical>, you'll be put into <radical>prison</radical> with nothing but <radical>rice</radical> to eat. You'll especially want to avoid picking <kanji>chrysanthemums</kanji>. ","meaning_hint":"Chrysanthemums are super important in Japan because they're the symbol of the imperial family. They're even on the cover of Japanese passports. Please don't ever pick them unless you want to end up in prison eating only rice for the rest of your life.","reading_mnemonic":"If you go to prison for <kanji>chrysanthemum</kanji> picking, everyone in the prison is going to <reading>kick</reading> (きく) you nonstop. You broke the chrysanthemum picking law, so kicking is your punishment. And believe me, you don't want these kicks.","reading_hint":"Imagine holding a chrysanthemum in your hands while you get kicked over and over and over in prison. Was it worth it?","vocabulary":[{"word":"白菊","level":46,"meaning":"White Chrysanthemum","reading":"しらぎく"}]},{"id":1970,"level":46,"kanji":"誇","onyomi":[{"reading":"こ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ほこ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Pride","primary":true,"accepted_answer":true}],"meaning_mnemonic":"<radical>Say</radical> \"<radical>two</radical> <radical>big</radical> <radical>prison</radical>s\" with <kanji>pride</kanji>! Nobody said you can't have pride after serving time in two big prisons. So say it with your chest!","meaning_hint":"Imagine really puffing out your chest and saying, \"Yes, two big prisons!\", with all the pride you can muster. ","reading_mnemonic":"After mustering all your <kanji>pride</kanji>, you feel like a new person, reborn almost. \"I feel like a <reading>子</reading> (こ) again!\", you proclaim to the world.","reading_hint":"With your regained, child-like pride, you venture out into the world after spending way too much time in those two big prisons. A new life awaits you, good luck!","vocabulary":[{"word":"誇大","level":46,"meaning":"Exaggeration","reading":"こだい"},{"word":"誇る","level":46,"meaning":"To Be Proud Of","reading":"ほこる"},{"word":"誇張","level":46,"meaning":"Exaggeration","reading":"こちょう"}]},{"id":1944,"level":46,"kanji":"鈍","onyomi":[{"reading":"どん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"にぶ","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"のろ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Dull","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Make <radical>barracks</radical> out of <radical>gold</radical> and they will get <kanji>dull</kanji> quickly. Gold is soft, it's okay for jewelry and delicate things that aren't used much, but barracks for soldiers? Those are used constantly, and they get worn out easily. What was once shiny gold will go dull in days.","meaning_hint":"Picture a huge barracks made of dull, almost brown, gold. Maybe you should have picked a better material.","reading_mnemonic":"As you stare sadly at the <kanji>dull</kanji> barracks, the <reading>don</reading> (どん) shows up out of nowhere, and he's pissed. He turns his angry gaze toward you and says, \"How did my barracks get so dull? Are you at fault? This is bad, this is very bad. Someone will pay for this.\"","reading_hint":"You stand cowering in front of the don as he inspects how dull the gold barracks are. You don't wanna be off'd for this just because the don was dull enough to make you use gold!","vocabulary":[{"word":"鈍い","level":46,"meaning":"Dull","reading":"にぶい"},{"word":"鈍感","level":46,"meaning":"Insensitive","reading":"どんかん"},{"word":"鈍器","level":46,"meaning":"Blunt Weapon","reading":"どんき"}]},{"id":1965,"level":46,"kanji":"錬","onyomi":[{"reading":"れん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ね","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Tempering","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>gold</radical> from the <radical>east</radical> needs <kanji>tempering</kanji> before it can be sold. The gold from the east is good, it just needs some tempering before it's entirely presentable. You know, tempering like you'd do in a forge.","meaning_hint":"Imagine tempering this gold from the east. You're heat treating the gold when you're tempering it, so feel the heat from the fire on your face and arms.","reading_mnemonic":"The smithy where you’re doing the <kanji>tempering</kanji> is pretty fancy, but it’s just a <reading>ren</reading>tal (れん). You haven't sold enough gold to own a smithy as nice as this one yet, so for now, you rent one. It is pretty swanky though, even for a rental.","reading_hint":"Imagine yourself tempering your gold with this shabby rental forge. It keeps flaring up and almost burning off your eyebrows every time you try to work it. This shabby rental forge…","vocabulary":[{"word":"鍛錬","level":46,"meaning":"Tempering","reading":"たんれん"},{"word":"錬金術","level":46,"meaning":"Alchemy","reading":"れんきんじゅつ"}]},{"id":1964,"level":46,"kanji":"鍛","onyomi":[{"reading":"たん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"きた","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Forge","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You want to turn your <radical>gold</radical> <radical>comb</radical> into a <radical>weapon</radical>, so you throw it into the <kanji>forge</kanji>.","meaning_hint":"Once the gold comb has melted down in the forge, you can forge it into whatever weapon you want.","reading_mnemonic":"You're trying to work the <kanji>forge</kanji>, but it's harder than you thought. You end up forging outside all day and get a wicked <reading>tan</reading> (たん).","reading_hint":"Most people who do forge work have tans. And now you know why.","vocabulary":[{"word":"鍛錬","level":46,"meaning":"Tempering","reading":"たんれん"},{"word":"鍛える","level":46,"meaning":"To Forge","reading":"きたえる"}]},{"id":1957,"level":46,"kanji":"鍵","onyomi":[{"reading":"けん","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"かぎ","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Key","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You take some <radical>gold</radical> and cover your <radical>yoga</radical> <radical>brush</radical> in it, turning it into a <kanji>key</kanji>. You shove the brush you normally use for yoga into the lock to your car and pour the gold over it. Now it's the right shape to be a key!","meaning_hint":"You lost your old key, you see. But you're a go with the flow type of person, thanks to all the yoga, so you make a new one!","reading_mnemonic":"This <kanji>key</kanji> has to be perfect, because if it isn't the <reading>ca</reading>r <reading>gui</reading>llotine (かぎ) will come down and chop off your hand!","reading_hint":"Imagine carefully putting your makeshift key into your car's lock. You close your eyes and pray that the car guillotine isn't going to trigger, knowing it isn't a legit key.","vocabulary":[]},{"id":1972,"level":46,"kanji":"阻","onyomi":[{"reading":"そ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"はば","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Thwart","primary":true,"accepted_answer":true}],"meaning_mnemonic":"If you see a <radical>building</radical> wearing a giant <radical>top hat</radical>, beware! This building is a fake and it's trying to <kanji>thwart</kanji> all of the plans the people in other buildings have.","meaning_hint":"Picture the building, with it's tall top hat, inching closer to other buildings when no one is looking. It's planning to thwart everything!","reading_mnemonic":"The building next door is being painted, and the top hat building is jealous. It <kanji>thwart</kanji>s the painting plans by dumping <reading>so</reading>ap (そ) out of its windows and onto the painters and the building!","reading_hint":"Watch as the soap cleans all of the paint away, thwarting the entire paint project. The painters are on the ground, crying and squeaky clean.","vocabulary":[{"word":"阻む","level":46,"meaning":"To Thwart","reading":"はばむ"},{"word":"阻止","level":46,"meaning":"Obstruction","reading":"そし"},{"word":"阻害","level":46,"meaning":"Obstruction","reading":"そがい"}]},{"id":1958,"level":46,"kanji":"零","onyomi":[{"reading":"れい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"こぼ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Zero","primary":true,"accepted_answer":true},{"meaning":"Spill","primary":false,"accepted_answer":true}],"meaning_mnemonic":"You get <radical>rain</radical> <radical>orders</radical>. Your orders are to make sure there is <kanji>zero</kanji> <kanji>spill</kanji>.","meaning_hint":"Despite it raining, your orders are to make sure none (zero!) of the rain spills anywhere. Figure out what you need to do to make sure you follow these rain orders successfully. Zero spill, alright?","reading_mnemonic":"The best way to make sure there is <kanji>zero</kanji> <kanji>spill</kanji> when it rains is to get rid of the rain. You use a special <reading>ray</reading> (れい) gun and zap the rain right out of the sky. There will be zero spills because there will be zero rain.","reading_hint":"You just take your ray gun and \"zap!\" the clouds are gone. There will be zero spills today.\n\nHint: when you see the radical <radical>orders</radical> it's fairly likely the reading will be れい.","vocabulary":[{"word":"零下","level":46,"meaning":"Below Zero","reading":"れいか"},{"word":"零時","level":46,"meaning":"Midnight","reading":"れいじ"},{"word":"零点","level":46,"meaning":"Zero Points","reading":"れいてん"},{"word":"零す","level":47,"meaning":"To Spill Something","reading":"こぼす"},{"word":"零れる","level":48,"meaning":"To Get Spilled","reading":"こぼれる"}]},{"id":1945,"level":46,"kanji":"魔","onyomi":[{"reading":"ま","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Devil","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Below the <radical>canopy</radical> of <radical>tree</radical>s is a <radical>demon</radical>. This demon is a <kanji>devil</kanji>.","meaning_hint":"You thought the devil hangs out in hell, but he actually hangs out under this canopy of trees.","reading_mnemonic":"Why is the <kanji>devil</kanji> under a canopy of trees? Because he's looking for his <reading>ma</reading>ma (ま).","reading_hint":"Into the trees is where all mamas go missing. And so the devil searches for his mama under this canopy of trees.","vocabulary":[{"word":"悪魔","level":46,"meaning":"Devil","reading":"あくま"},{"word":"魔法","level":46,"meaning":"Magic","reading":"まほう"},{"word":"魔術","level":46,"meaning":"Black Magic","reading":"まじゅつ"},{"word":"魔女","level":46,"meaning":"Witch","reading":"まじょ"},{"word":"魔法使い","level":48,"meaning":"Wizard","reading":"まほうつかい"},{"word":"邪魔","level":50,"meaning":"Hindrance","reading":"じゃま"}]},{"id":1942,"level":46,"kanji":"鳩","onyomi":[{"reading":"く","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"はと","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Dove","primary":true,"accepted_answer":true},{"meaning":"Pigeon","primary":false,"accepted_answer":true}],"meaning_mnemonic":"There are <radical>nine</radical> <radical>bird</radical>s and one of them is a <kanji>dove</kanji> and another is a <kanji>pigeon</kanji>. These nine birds are a flock of all kinds, but the dove and the pigeon are the leaders.","meaning_hint":"Look at these nine birds strutting down the street like they own the place. The dove and pigeon are out in front because they are the most important. Hear them chirping and fluttering their feathers about.","reading_mnemonic":"Take a look at the <kanji>pigeon</kanji> in front of you. Now, grab it, tear it in half, and grab the <reading>heart</reading> (はと) from its little body. ","reading_hint":"Devour it. You love pigeon hearts. Discard the rest, keep the heart.","vocabulary":[]},{"id":1941,"level":46,"kanji":"墨","onyomi":[],"kunyomi":[{"reading":"すみ","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Black Ink","primary":true,"accepted_answer":true},{"meaning":"Ink","primary":false,"accepted_answer":true}],"meaning_mnemonic":"You use <radical>black</radical> <radical>dirt</radical> to make <kanji>black ink</kanji>. That's what you use to write in black!","meaning_hint":"Make sure the dirt you're using to make black ink is really, really black. Like the kind you find around volcanoes or something.","reading_mnemonic":"Be careful that you don't spill <kanji>black ink</kanji> on anyone or anything. If you do, you have to own it. Imagine spilling black ink on someone, and when they confront you, you yell, \"Yeah I got black ink on you, so <reading>sue me</reading> (すみ)!\"","reading_hint":"Imagine yelling \"SUE ME!\" at someone's face, which is covered in the black ink you spilled there.","vocabulary":[{"word":"墨絵","level":46,"meaning":"Ink Painting","reading":"すみえ"},{"word":"入れ墨","level":46,"meaning":"Tattoo","reading":"いれずみ"}]}]