[{"id":2074,"level":49,"kanji":"俗","onyomi":[{"reading":"ぞく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Vulgar","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>leader</radical> of this <radical>valley</radical> is very <kanji>vulgar</kanji>. The name of the valley is Vulgar Valley, so it makes sense for its leader to be very vulgar.","meaning_hint":"Imagine meeting the leader of Vulgar Valley. Imagine all the vulgar things he says to prove he is worthy of being the leader of Vulgar Valley. He is so very, very vulgar.","reading_mnemonic":"This <kanji>vulgar</kanji> leader leads his Boso<reading>zoku</reading> (ぞく) bike gang through Vulgar Valley, patrolling the area and spreading vulgarity as he goes.","reading_hint":"Hear the motorcycles rev and purr as they carouse the Vulgar Valley. Hear the leader screaming vulgar things as he and his Bosozoku bike gang ride all around.","vocabulary":[{"word":"俗語","level":49,"meaning":"Colloquialism","reading":"ぞくご"},{"word":"民俗","level":49,"meaning":"Folk Customs","reading":"みんぞく"}]},{"id":2203,"level":49,"kanji":"准","onyomi":[{"reading":"じゅん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Semi","primary":true,"accepted_answer":true},{"meaning":"Ratify","primary":false,"accepted_answer":true}],"meaning_mnemonic":"Put a <radical>turkey</radical> on <radical>ice</radical> and it will only get <kanji>semi</kanji> frozen. You add more ice, and it stays the same. Only some of it will freeze. What the heck!","meaning_hint":"Imagine covering a turkey in ice and every time you check it, it's only semi frozen. It doesn't matter what you do, it just refuses to freeze all the way through.","reading_mnemonic":"Finally you realize it will only <kanji>semi</kanji> freeze because it's <reading>June</reading> (じゅん)! It's too hot out for your turkey to freeze all the way. The ice keeps melting off the top and semi thawing it!","reading_hint":"The lesson is to never try to freeze something in June. If you do it will only semi freeze.","vocabulary":[{"word":"准教授","level":49,"meaning":"Associate Professor","reading":"じゅんきょうじゅ"},{"word":"批准","level":53,"meaning":"Ratification","reading":"ひじゅん"}]},{"id":2059,"level":49,"kanji":"刈","onyomi":[],"kunyomi":[{"reading":"か","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Prune","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Take your greatest <radical>treasure</radical>, hold a <radical>knife</radical> nice and close to it, and <kanji>prune</kanji> away all the weak and dead bits.","meaning_hint":"All treasures need to be taken care of, no matter what they are. Prune away anything that isn't necessary.","reading_mnemonic":"Currently, you want to <kanji>prune</kanji> your greatest treasure: your <reading>ca</reading>r (か). Your car is made of wood, and it keeps trying to grow new buds and branches, so you have to prune them off.","reading_hint":"You want your car to be small and sleek, not a giant truck, so you have to carefully prune it when it grows too much.","vocabulary":[{"word":"刈る","level":49,"meaning":"To Prune","reading":"かる"},{"word":"草刈り","level":49,"meaning":"Mowing","reading":"くさかり"},{"word":"刈り取る","level":49,"meaning":"To Mow","reading":"かりとる"}]},{"id":2060,"level":49,"kanji":"剛","onyomi":[{"reading":"ごう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Sturdy","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>hill</radical> <radical>knife</radical> is the most <kanji>sturdy</kanji> knife you can find.","meaning_hint":"The reason hill knives are so sturdy is because they are shaped like hills. Very wide, very thick, not so long. So, they don't break and are more sturdy.","reading_mnemonic":"This <kanji>sturdy</kanji> (but strangely shaped) knife is used by Grandpa <reading>ごう</reading>いち. ","reading_hint":"Imagine Grandpa ごういち rolling the knife back and forth over various things to cut them. \"I love my sturdy hill knife,\" he says.","vocabulary":[{"word":"剛健","level":49,"meaning":"Vigor","reading":"ごうけん"}]},{"id":2080,"level":49,"kanji":"劣","onyomi":[{"reading":"れつ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"おと","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Inferiority","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>few</radical> members of society without <radical>power</radical> suffer from severe <kanji>inferiority</kanji> complexes. Most people in this world have lots of power, so the few that do not feel quite inferior. It is this feeling of inferiority that fuels their inferiority complexes.","meaning_hint":"Imagine you are one of the few without power. Feel the inferiority crushing down on you. It feels terrible and there is nothing you can do about it.","reading_mnemonic":"Since you suffer from such extreme feelings of <kanji>inferiority</kanji>, when someone offers you and your friends the chance to gain power, you yell “<reading>Let’s</reading> (れつ) go!” without a second thought. “Let’s go, guys! Come on! Power awaits us!”","reading_hint":"Let’s go, let’s go! Time’s a wastin’! I’m tired of this inferiority and want to gain some power!","vocabulary":[{"word":"劣化","level":49,"meaning":"Deterioration","reading":"れっか"},{"word":"劣悪","level":49,"meaning":"Inferiority","reading":"れつあく"},{"word":"劣等感","level":49,"meaning":"Inferiority Complex","reading":"れっとうかん"},{"word":"劣る","level":49,"meaning":"To Be Inferior To","reading":"おとる"},{"word":"卑劣","level":59,"meaning":"Mean","reading":"ひれつ"}]},{"id":2081,"level":49,"kanji":"勘","onyomi":[{"reading":"かん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Intuition","primary":true,"accepted_answer":true}],"meaning_mnemonic":"This <radical>crab trap</radical> has the <radical>power</radical> of <kanji>intuition</kanji>. By the power of intuition, this crab trap can trap like, every crab. Through intuition, it knows where the crabs will go and how they will react, so it is much easier to trap them.","meaning_hint":"Look at this crab trap and see it visibly glowing with intuition. Its powers of intuition are so strong that you can actually see it shimmering with intuition as it expertly traps all those crabs.","reading_mnemonic":"This crab trap's <kanji>intuition</kanji> powers were extracted from Genghis <reading>Khan</reading> (かん) himself. And as we all know by now, Genghis Khan was the absolute master of intuition, he always knew what his enemies and his allies were about to do.","reading_hint":"Genghis Khan probably has the strongest intuition of anyone in history. This crab trap is getting close though.","vocabulary":[{"word":"勘案","level":49,"meaning":"Taking Into Consideration","reading":"かんあん"},{"word":"勘弁","level":49,"meaning":"Pardon","reading":"かんべん"},{"word":"割り勘","level":49,"meaning":"Splitting The Cost","reading":"わりかん"},{"word":"勘違い","level":49,"meaning":"Misunderstanding","reading":"かんちがい"},{"word":"勘定","level":51,"meaning":"Calculation","reading":"かんじょう"}]},{"id":2061,"level":49,"kanji":"唯","onyomi":[{"reading":"ゆい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ただ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Solely","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>mouth</radical> of that <radical>turkey</radical> is <kanji>solely</kanji> his. It’s very unique, so that mouth could belong to no other turkey but him. That mouth is solely his.","meaning_hint":"Imagine what makes this turkey’s mouth so unique. This beak is solely his. It belongs to no other. This turkey is the only turkey with a mouth like his.","reading_mnemonic":"You traveled a long way to see this turkey and the mouth that is <kanji>solely</kanji> his but you missed your exit on the highway and you have to hang a <reading>U-ey</reading> (ゆい). You know what hang a U-ey means, right? It’s making a U-turn. Well, you have to hang a U-ey on the highway so you can get off at the right spot to see this turkey and the mouth that is solely his.","reading_hint":"Imagine hanging a U-ey on the highway. Hear your tires screech as you turn around and get off where you’re supposed to.","vocabulary":[{"word":"唯一","level":49,"meaning":"Only","reading":"ゆいつ"},{"word":"唯物論","level":49,"meaning":"Materialism","reading":"ゆいぶつろん"}]},{"id":2062,"level":49,"kanji":"壇","onyomi":[{"reading":"だん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Podium","primary":true,"accepted_answer":true}],"meaning_mnemonic":"On the <radical>dirt</radical> there is a <radical>lid</radical> trying to cover the number of <radical>times</radical> the <radical>dawn</radical> has risen here. You walk over and pull the lid off and the whole thing transforms into a <kanji>podium</kanji>. A podium for the dawn to tell you how many times it's risen over this dirt over and over again. It just keeps going and you realize the lid was here because this dang podium can't seem to keep a lid on it! (Get it? Figure of speech!)","meaning_hint":"This kanji also just... really looks like a podium right? With a guy wearing a graduation cap, pointing toward you, in the crowd.","reading_mnemonic":"You listen to what the <kanji>podium</kanji> has to say for so long you finally can't help but ask, \"Who are you?\" \"I'm the <reading>dawn</reading> (だん), of course!\" And this is my podium where I spread the good news about the dawn!","reading_hint":"I guess that makes sense. This podium is by the dawn for the dawn.","vocabulary":[{"word":"花壇","level":49,"meaning":"Flower Bed","reading":"かだん"},{"word":"仏壇","level":49,"meaning":"Buddhist Altar","reading":"ぶつだん"}]},{"id":2079,"level":49,"kanji":"奨","onyomi":[{"reading":"しょう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Encourage","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>commander</radical> who's <radical>big</radical> will use his size to <kanji>encourage</kanji> his troops.","meaning_hint":"\"Look at me! You can be a big commander someday too!\" he shouts, encouraging everyone.","reading_mnemonic":"He <kanji>encourage</kanji>s the <reading>Shou</reading>gun (しょう) too! You've never seen the Shougun express any emotion other than intense indifference or intense dislike.","reading_hint":"Picture the encouraged Shougun: his eyes are shining with tears, his heart is pounding, he's been encouraged to be better!","vocabulary":[{"word":"推奨","level":49,"meaning":"Recommendation","reading":"すいしょう"},{"word":"奨学金","level":49,"meaning":"Scholarship","reading":"しょうがくきん"}]},{"id":2082,"level":49,"kanji":"妃","onyomi":[{"reading":"ひ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"きさき","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Princess","primary":true,"accepted_answer":true},{"meaning":"Queen","primary":false,"accepted_answer":true}],"meaning_mnemonic":"A <radical>woman</radical> sees herself (<radical>oneself</radical>) as a <kanji>princess</kanji> or a <kanji>queen</kanji>. As women should! ","meaning_hint":"Just remember, when you're around other women (and woman-aligned peoples), it's important to treat each other like princess and queens, not just oneself.","reading_mnemonic":"All of us <kanji>princess</kanji>es and <kanji>queen</kanji>s share a special <reading>hea</reading>t (ひ). When we see another princess or queen that heat passes through us and we nod to one another.","reading_hint":"All princess and queens can feel the heat coming off of the others.","vocabulary":[{"word":"王妃","level":49,"meaning":"Queen","reading":"おうひ"},{"word":"皇太子妃","level":49,"meaning":"Crown Princess","reading":"こうたいしひ"},{"word":"〜妃","level":49,"meaning":"Princess","reading":"ひ"}]},{"id":2063,"level":49,"kanji":"尼","onyomi":[{"reading":"に","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"あま","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Nun","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You give a <radical>flag</radical> and a <radical>spoon</radical> to a <kanji>nun</kanji> as an offering. You give her this flag and this spoon because they are very precious to you and you want to show the nun how serious you are about repenting for your evil deeds.","meaning_hint":"Imagine handing the nun your country’s flag. And also a spoon that is very valuable to you. Imagine getting down on one knee as you do so.","reading_mnemonic":"You’re getting down on one <reading>knee</reading> (に) as you present the flag and the spoon to the <kanji>nun</kanji>. The nun accepts your offer and takes your flag and spoon from you. Your soul is saved!","reading_hint":"Feel your knee digging into the cold floor as you present your offerings to the nun. You feel slightly sad as she takes your precious belongings from you.","vocabulary":[{"word":"尼僧","level":49,"meaning":"Nun","reading":"にそう"}]},{"id":2072,"level":49,"kanji":"征","onyomi":[{"reading":"せい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Subjugate","primary":true,"accepted_answer":true}],"meaning_mnemonic":"If someone <radical>loiter</radical>s it's <radical>correct</radical> to <kanji>subjugate</kanji> them.","meaning_hint":"You can't just let people do whatever they want. If it isn't correct to loiter here, then it IS correct to subjugate them, and force them to do what you want. You control them now. And they're gonna get it!","reading_mnemonic":"You <kanji>subjugate</kanji> these loiterers with your holy blue <reading>sa</reading>ber (せい)! It's the correct thing to do, after all, and you were given this saber all those levels ago because you did the correct thing.","reading_hint":"As you swing your saber around, subjugating the loiterers, and making them do as you say, you remind yourself that this is correct. And if it's correct, you have to use your saber to enforce it.","vocabulary":[{"word":"遠征","level":49,"meaning":"Expedition","reading":"えんせい"},{"word":"征服","level":49,"meaning":"Conquest","reading":"せいふく"}]},{"id":2054,"level":49,"kanji":"悟","onyomi":[{"reading":"ご","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"さと","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Comprehension","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Your <radical>soul</radical> connects to <radical>five</radical> different <radical>mouths</radical>, enhancing your <kanji>comprehension</kanji>. You can easily comprehend what each of those souls belonging to those mouths wants and feels deep down.","meaning_hint":"Imagine being able to comprehend everything about not one, but five other people. Deep down you can feel everything they think and feel.","reading_mnemonic":"Your <kanji>comprehension</kanji> is the strongest with the fifth mouth, belonging to <reading>Go</reading>dzilla (ご). You finally get why he wants to destroy buildings and cities.","reading_hint":"Your comprehension of Godzilla reveals so much: he's warning the Japanese people about the use of new technology and warfare and experimentation. He just wants everyone to be able to comprehend these new, seemingly incomprehensible things!","vocabulary":[{"word":"悟る","level":49,"meaning":"To Realize","reading":"さとる"},{"word":"覚悟","level":49,"meaning":"Mental Readiness","reading":"かくご"}]},{"id":8881,"level":49,"kanji":"慌","onyomi":[{"reading":"こう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"あわ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Confused","primary":true,"accepted_answer":true},{"meaning":"Bewildered","primary":false,"accepted_answer":true}],"meaning_mnemonic":"Your <radical>soul</radical> is going <radical>wild</radical> because you're <kanji>confused</kanji>. If you're confused, it's usually because you don't know what's going on or what to do. This makes the soul inside your body go absolutely wild!","meaning_hint":"Think back to the last time you were confused. Remember how your soul felt? You were so confused it went wild and made you feel dumb and bad, like a wild person.","reading_mnemonic":"Whenever you're <kanji>confused</kanji>, <reading>こう</reading>いち appears to offer you guidance. He's confused a lot, so he knows how to help. And knowledge offered by こういち is the best medicine for confusion.","reading_hint":"Imagine being confused about Japanese, for example. In your confusion everything seems scary and wild and your soul is utterly bewildered, but then here comes こういち. He sits with you and pats your back and tries to help you stop being so confused.","vocabulary":[{"word":"慌てる","level":49,"meaning":"To Panic","reading":"あわてる"},{"word":"恐慌","level":49,"meaning":"Panic","reading":"きょうこう"},{"word":"慌ただしい","level":51,"meaning":"Hurried","reading":"あわただしい"},{"word":"世界恐慌","level":51,"meaning":"The Great Depression","reading":"せかいきょうこう"}]},{"id":2052,"level":49,"kanji":"抽","onyomi":[{"reading":"ちゅう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Extract","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Your <radical>fingers</radical> give you a good <radical>reason</radical> to <kanji>extract</kanji> things. You extract juice from fruits, oil from seeds, and coffee from beans. Why? Because you have fingers! That's your reason.","meaning_hint":"Imagine having fingers that work like a magic wand of extraction. With a flick of your fingers, you could extract any radical out of a kanji too. How could these special fingers not be a reason for you to extract? With these fingers, you can't stop extracting!","reading_mnemonic":"Your magic fingers can even extract the essence out of living things, so you decide to <kanji>extract</kanji> some from <reading>Chew</reading>bacca (ちゅう). You always thought a nice Chewbacca extract could take your cookies to the next level. It'll help offset the sweetness and make them extra chewy (or chewbacca-y!). ","reading_hint":"Taste that chewy goodness in every bite. All you need is a dash of Chewbacca extract.","vocabulary":[{"word":"抽象","level":49,"meaning":"Abstraction","reading":"ちゅうしょう"},{"word":"抽選","level":49,"meaning":"Lottery","reading":"ちゅうせん"},{"word":"抽出","level":49,"meaning":"Extraction","reading":"ちゅうしゅつ"}]},{"id":2055,"level":49,"kanji":"拓","onyomi":[{"reading":"たく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Cultivation","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You use your <radical>fingers</radical> and a <radical>stone</radical> to begin <kanji>cultivation</kanji> of the land. You use your fingers to till the soil, the stone to flatten the ground, and you carefully poke the seeds into the dirt and then use the stone to smash them further down.","meaning_hint":"Imagine being in a field, using your fingers and a stone to cultivate the whole thing, by hand.","reading_mnemonic":"<kanji>Cultivation</kanji> is suddenly halted because a <reading>tack</reading> (たく) sticks into your finger. You pull the tack out, throw it away and start cultivation again when... ouch! There's another tack. This field is full of tacks!","reading_hint":"Now cultivation is going to involve getting all the tacks out of here, preferably with the stone and not your fingers, so they don't get stuck anymore.","vocabulary":[{"word":"開拓","level":49,"meaning":"Reclamation","reading":"かいたく"},{"word":"拓哉","level":57,"meaning":"Takuya","reading":"たくや"}]},{"id":2056,"level":49,"kanji":"拘","onyomi":[{"reading":"こう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"かか","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Arrest","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You run your <radical>fingers</radical> along the words of a  <radical>paragraph</radical>. You are learning about the law because you plan to <kanji>arrest</kanji> somebody.","meaning_hint":"Imagine reading the paragraph very slowly. You find your answer. It looks like you'll be able to arrest that person...","reading_mnemonic":"Who do you want to <kanji>arrest</kanji>? You want to arrest <reading>こう</reading>いち. Even though he's started wars, created a religion, and trapped a child in a cavity, it's going to be tricky to arrest him because he's the emperor now.","reading_hint":"Still, according to this paragraph you're running your fingers through, you can do it. You can arrest こういち.","vocabulary":[{"word":"拘置","level":49,"meaning":"Detention","reading":"こうち"}]},{"id":2075,"level":49,"kanji":"桑","onyomi":[{"reading":"そう","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"くわ","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Mulberry","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You take a <radical>stool</radical>, another <radical>stool</radical>, and yet another <radical>stool</radical> and stack them on top of a <radical>tree</radical> to make a <kanji>mulberry</kanji> bush. This is how mulberry bushes are made. You take three stools and you put them atop a tree.","meaning_hint":"Imagine putting three stools on top of a tree and watching it transform into a mulberry. The science of nature!","reading_mnemonic":"Your <kanji>mulberry</kanji> tree then produces a <reading>qua</reading>ntity (くわ) of mulberries. Yum.","reading_hint":"Imagine the huge quantity of mulberries growing from your stool tree. Imagine picking them all. What an enormous quantity of mulberries you now have.","vocabulary":[{"word":"桑畑","level":49,"meaning":"Mulberry Field","reading":"くわばたけ"},{"word":"桑原","level":50,"meaning":"Mulberry Field","reading":"くわばら"}]},{"id":2064,"level":49,"kanji":"概","onyomi":[{"reading":"がい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"おおむ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Approximation","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Bite a <radical>tree</radical>'s <radical>root</radical> with your <radical>fang</radical> to get an <kanji>approximation</kanji> on its age. It won't be exact, this isn't scientific or anything, but it will be pretty close.","meaning_hint":"Once you have an approximation on the age, you'll be able to come up with an approximation on how much it's worth too.","reading_mnemonic":"As you're recording your <kanji>approximation</kanji> down,  somebody comes up and shouts, “Hey <reading>guy</reading> (がい)! I’ll give you $10,000 for that tree there, guy!” This guy must be crazy. That’s much more than your approximation of the value of this thing. But you sell it to the guy anyway.","reading_hint":"The guy is trying to look at your approximation now, while calling YOU \"guy\" over and over, and you just want him to buy it and leave you alone!","vocabulary":[{"word":"気概","level":49,"meaning":"Strong Spirit","reading":"きがい"},{"word":"概算","level":49,"meaning":"Approximation","reading":"がいさん"},{"word":"概念","level":49,"meaning":"General Idea","reading":"がいねん"},{"word":"概要","level":49,"meaning":"Outline","reading":"がいよう"},{"word":"大概","level":49,"meaning":"In General","reading":"たいがい"},{"word":"一概に","level":49,"meaning":"Unconditionally","reading":"いちがいに"}]},{"id":2065,"level":49,"kanji":"浸","onyomi":[{"reading":"しん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ひた","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"つ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Immersed","primary":true,"accepted_answer":true}],"meaning_mnemonic":"In the event of a <radical>tsunami</radical>, <radical>Wolverine</radical>, your <radical>forehead</radical>, and a <radical>stool</radical> will all be <kanji>immersed</kanji> in it. You will become immersed in the tsunami after it hits because tsunamis are gigantic and bring a lot of water. Now you and your forehead are immersed in the tsunami along with Wolverine and a stool.","meaning_hint":"Feel the water all around you as you become immersed in this tsunami. See Wolverine trying to swim his way to the top as you watch the stool floating about in the water.","reading_mnemonic":"Still <kanji>immersed</kanji>, the stool floats over and hits you in the <reading>shin</reading> (しん). The tsunami gave the stool a good push and while it was fully immersed, it ran into your shin. It really hurts.","reading_hint":"Hear the stool crack against your shin and feel the pain erupt through your leg. You try to scream but you’re under water so you just get a big mouthful of tsunami.","vocabulary":[{"word":"浸透","level":49,"meaning":"Permeation","reading":"しんとう"},{"word":"浸る","level":49,"meaning":"To Be Soaked In","reading":"ひたる"},{"word":"浸水","level":49,"meaning":"Submersion","reading":"しんすい"},{"word":"浸す","level":51,"meaning":"To Soak","reading":"ひたす"}]},{"id":2066,"level":49,"kanji":"淡","onyomi":[{"reading":"たん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"あわ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Faint","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>tsunami</radical> and a couple <radical>fire</radical>s run into each other. They cancel each other out completely, and the remainder left behind is a <kanji>faint</kanji> remnant of what was once there.","meaning_hint":"You go to see if you can find any remainder of the fire + tsunami battle. You can, but it's so faint.","reading_mnemonic":"Just like the tsunami and fire canceling each other out, leaving a <kanji>faint</kanji> remainder of what was, your <reading>tan</reading> (たん) is extremely faint as well.","reading_hint":"Look at your skin. It has such a faint tint.","vocabulary":[{"word":"淡い","level":49,"meaning":"Faint","reading":"あわい"},{"word":"淡水","level":49,"meaning":"Fresh Water","reading":"たんすい"}]},{"id":2076,"level":49,"kanji":"潤","onyomi":[{"reading":"じゅん","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"うるお","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"うる","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Watered","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>tsunami</radical> at the <radical>gate</radical> of the <radical>king</radical> makes sure all of his plants get <kanji>watered</kanji>. The gate prevents the tsunami from damaging anything inside the king’s home, and the plants around the gate get watered by the water of the tsunami.","meaning_hint":"Hear the tsunami crash into the gate as you see the water slosh around and make sure that all of the king’s plants get good and watered.","reading_mnemonic":"These plants are getting <kanji>watered</kanji> in <reading>June</reading> (じゅん), the month they need watering the most. June is a hot month, so it’s good that this tsunami came and got the king’s plants watered when it did.","reading_hint":"Again, watch and hear the tsunami crashing into the gate and getting the plants watered. This time, remember that the month is June and it is very hot and sticky outside. You’re sweating and very hot.","vocabulary":[{"word":"潤う","level":49,"meaning":"To Be Moist","reading":"うるおう"},{"word":"利潤","level":49,"meaning":"Profit","reading":"りじゅん"},{"word":"潤い","level":51,"meaning":"Moisture","reading":"うるおい"}]},{"id":2067,"level":49,"kanji":"煮","onyomi":[{"reading":"しゃ","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"に","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Boil","primary":true,"accepted_answer":true}],"meaning_mnemonic":"If <radical>someone</radical> wants to <radical>boil</radical>, you let them <kanji>boil</kanji>!","meaning_hint":"There's someone in your face yelling about how they want to boil! You yell back, \"Okay, if you want to boil, just boil!\"","reading_mnemonic":"Welp, the pot is at a rolling <kanji>boil</kanji> and your <reading>knee</reading> (に) is in there. The person wasn't saying they wanted to boil, they said they wanted to boil someone. And that meant you. Well, your knee anyway.","reading_hint":"Once your knee is done boiling, the person kneels down in front of you and presents it on a platter, mocking you, since you can't kneel anymore. You should pay more attention to what's going on from now on or you could find yourself in... HOT WATER. Ohohoho.","vocabulary":[{"word":"煮る","level":49,"meaning":"To Boil Something","reading":"にる"},{"word":"雑煮","level":49,"meaning":"New Year's Dish","reading":"ぞうに"},{"word":"煮物","level":49,"meaning":"Boiled Foods","reading":"にもの"},{"word":"煮える","level":50,"meaning":"To Be Boiled","reading":"にえる"}]},{"id":2077,"level":49,"kanji":"珠","onyomi":[{"reading":"しゅ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"たま","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Pearl","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>king</radical> takes his <radical>slide</radical> into his private <radical>jet</radical> and is given a <kanji>pearl</kanji> as a gift, by you! He's letting you ride in his jet today, and you were told the king should be presented with a pearl as soon as he boards.","meaning_hint":"Imagine giving this gorgeous white pearl to the king after he slides down his slide and boards the jet. See his king face light up as he sees the pretty pearl.","reading_mnemonic":"The king takes the <kanji>pearl</kanji> and tosses it into a <reading>chu</reading>te (しゅ) next to the slide he took to get into the jet. You watch as the pearl goes down, down, down until it lands into a huge vat of pearls.","reading_hint":"Oh. I guess the king didn't need your pearl, since he has a pearl chute to get them off his jet before takeoff. You feel silly. And you kind of want to jump into the pearl chute yourself.","vocabulary":[{"word":"数珠","level":49,"meaning":"Rosary","reading":"じゅず"},{"word":"珠算","level":49,"meaning":"Calculation With Abacus","reading":"しゅざん"},{"word":"真珠","level":49,"meaning":"Pearl","reading":"しんじゅ"}]},{"id":2057,"level":49,"kanji":"礎","onyomi":[{"reading":"そ","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"いしずえ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Foundation","primary":true,"accepted_answer":true},{"meaning":"Cornerstone","primary":false,"accepted_answer":true}],"meaning_mnemonic":"There’s a <radical>stone</radical>, a <radical>tree</radical>, another <radical>tree</radical>, and a <radical>coat rack</radical>. That stone and two trees will make the perfect <kanji>foundation</kanji>, or <kanji>cornerstone</kanji>, for a house to put that coat rack in! This stone is flat and heavy and both of the trees are flexible and durable.","meaning_hint":"Imagine making a foundation with the stone and the two trees so you’ll have a place for your coat rack. Feel the wood grain and cold stone against your skin as you move them around to form the foundation.","reading_mnemonic":"After you finish the <kanji>foundation</kanji>, the only step that's left is to wash the entire thing with <reading>so</reading>ap (そ).","reading_hint":"Imagine getting on your hands and knees, rubbing a bar of soap all over the foundation you built. The soap gets into all the nooks and crannies in the wood and stone. Now if a coat falls off the coat rack onto the floor, you just add water and poof! Clean!","vocabulary":[{"word":"基礎","level":49,"meaning":"Foundation","reading":"きそ"}]},{"id":2078,"level":49,"kanji":"衰","onyomi":[{"reading":"すい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"おとろ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Decline","primary":true,"accepted_answer":true}],"meaning_mnemonic":"You take a <radical>lid</radical>, and aiming it at the <radical>sun</radical> you <radical>kick</radical> it into the air and eventually it begins to <kanji>decline</kanji> and crashes into the sun, causing it to supernova. Imagine kicking this lid so hard that it flies into space. See it fly up to the peak of its arch, then watch as it begins the decline until it finally collides with the sun.","meaning_hint":"As you watch the lid decline, keep in mind that the sun radical has its middle line extending outside the box on both sides. This is because the sun is going supernova. Pew!","reading_mnemonic":"As the lid begins to <kanji>decline</kanji> in the sky, you realize what’s going to happen so you attempt to <reading>swi</reading>ng (すい) to safety. Swing on some vines in the direction opposite of the sun. You know that once that lid finishes its decline and collides with the sun, there’s gonna be trouble.","reading_hint":"Imagine swinging on these vines as you hear the sun explode and go supernova behind you. Swing faster! Swing faster!","vocabulary":[{"word":"衰える","level":49,"meaning":"To Decline","reading":"おとろえる"},{"word":"老衰","level":49,"meaning":"Senility","reading":"ろうすい"},{"word":"衰退","level":49,"meaning":"Decline","reading":"すいたい"}]},{"id":2068,"level":49,"kanji":"覆","onyomi":[{"reading":"ふく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"おお","primary":false,"accepted_answer":false,"type":"kunyomi"},{"reading":"くつがえ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Capsize","primary":true,"accepted_answer":true},{"meaning":"Cover","primary":false,"accepted_answer":true}],"meaning_mnemonic":"If a <radical>helicopter</radical> <radical>loiter</radical>s near a <radical>black hole</radical> then it's going to <kanji>capsize</kanji>. I mean, yeah, it's not a boat, but just look, that's what's happening! That helicopter is going down!\n\nIf you want to save it you better <kanji>cover</kanji> up the black hole! The only way to save it from capsizing is to cover it right up!","meaning_hint":"Imagine trying to cover up a black hole so that the helicopter doesn't capsize. It's one or the other, dude. Cover or capsize. You decide.","reading_mnemonic":"You're doing your best to <kanji>cover</kanji> the black hole to stop the helicopter from <kanji>capsiz</kanji>ing but it's not working! “<reading>F**k</reading> you (ふく) black hole!\" you shout. You just want to cover it up! You just want to do the right thing!","reading_hint":"Man, f**k you you, black hole. F**k you you. Making that helicopter capsize and then refusing to be covered?","vocabulary":[{"word":"覆る","level":49,"meaning":"To Be Overturned","reading":"くつがえる"},{"word":"覆面","level":49,"meaning":"Mask","reading":"ふくめん"},{"word":"転覆","level":49,"meaning":"Capsizing","reading":"てんぷく"},{"word":"覆う","level":51,"meaning":"To Cover","reading":"おおう"}]},{"id":2053,"level":49,"kanji":"誓","onyomi":[{"reading":"せい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"ちか","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Vow","primary":true,"accepted_answer":true}],"meaning_mnemonic":"With your <radical>fingers</radical> under an <radical>axe</radical>, you <radical>say</radical> a <kanji>vow</kanji>. A vow is a sacred promise, so you have to be really serious when you say one. That's why you do it with an axe hovering above your fingers—it's a reminder that if you break this vow your fingers are gonna get chopped off.","meaning_hint":"Picture the axe hovering above your fingers. Now say the vow. But don't lie. The axe knows when you're lying.","reading_mnemonic":"When you finish your <kanji>vow</kanji>, you take out your holy blue <reading>sa</reading>ber (せい) and cut the axe in half! You know you're never going to break your vow, and if you do, you'll use your own saber to cut off your fingers.","reading_hint":"Imagine what it would be like to slice off your own fingers with the saber you've carried for so long. You better not break that vow. ","vocabulary":[{"word":"誓い","level":49,"meaning":"Vow","reading":"ちかい"},{"word":"誓約","level":49,"meaning":"Vow","reading":"せいやく"}]},{"id":2069,"level":49,"kanji":"謀","onyomi":[{"reading":"ぼう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"はか","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Conspire","primary":true,"accepted_answer":true}],"meaning_mnemonic":"Watch what you <radical>say</radical> to what appears to be a <radical>sweet</radical> <radical>tree</radical>, because that tree will 100% <kanji>conspire</kanji> against you.","meaning_hint":"Trees may look all sweet and innocent, like they aren't listening to every word you say, but it's a front! They're conspiring against you!! They'll blackmail you and take everything!!!","reading_mnemonic":"Now you're getting it! That tree is trying to <kanji>conspire</kanji> against you and take you down. Take your <reading>bow</reading>ling (ぼう) ball and bowl it and all its friends down!","reading_hint":"Watch as the conspiratorial tree and all it's gossiping friends are bowled over by your bowling ball. Phew. You're safe from the trees.\n\nFor now.","vocabulary":[{"word":"謀る","level":49,"meaning":"To Conspire","reading":"はかる"},{"word":"無謀","level":49,"meaning":"Reckless","reading":"むぼう"},{"word":"陰謀","level":49,"meaning":"Conspiracy","reading":"いんぼう"}]},{"id":8913,"level":49,"kanji":"蹴","onyomi":[{"reading":"しゅう","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"け","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Kick","primary":true,"accepted_answer":true}],"meaning_mnemonic":"In the <radical>foot</radical> <radical>capital</radical>, it's tough to be a <radical>dog</radical> because you're always getting <kanji>kick</kanji>ed. ","meaning_hint":"In the foot capital, you can only use your feet. So petting dogs looks a lot like kicking them.","reading_mnemonic":"Imagine yourself <kanji>kick</kanji>ing a <reading>ke</reading>ttle (け). There's nothing that's more satisfying to kick than a good ol' kettle, you know?","reading_hint":"You just love how a kettle gets dented as you kick it around.","vocabulary":[{"word":"蹴る","level":49,"meaning":"To Kick","reading":"ける"},{"word":"一蹴する","level":49,"meaning":"To Kick","reading":"いっしゅうする"}]},{"id":2073,"level":49,"kanji":"陛","onyomi":[{"reading":"へい","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Highness","primary":true,"accepted_answer":true}],"meaning_mnemonic":"<radical>Compare</radical> a <radical>building</radical> to some <radical>dirt</radical> and you'll see the difference between you and His and Her <kanji>Highness</kanji>. You live outside and sleep on the dirt. But His and Her Highness both live in a huge building.","meaning_hint":"Picture Her Highness, high up in her building. Now compare her home and life to yours, you dirt person.","reading_mnemonic":"I bet His <kanji>Highness</kanji> has never had to sleep in <reading>hay</reading> (へい) either, like you do every night. Hay is what you use as a pillow, mattress, blanket. Basically hay and dirt are all you have. Unlike His Highness.","reading_hint":"Picture His and Her Highness coming out of their huge building and walking by you in your hay pile. \"My goodness, Highness, have you ever seen such a dirty, fluffy creature?\" \"My no, dear, let's move quickly to remove it from our sight!\"","vocabulary":[{"word":"陛下","level":49,"meaning":"Your Majesty","reading":"へいか"}]},{"id":2070,"level":49,"kanji":"陶","onyomi":[{"reading":"とう","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[],"meanings":[{"meaning":"Pottery","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The only type of <radical>can</radical> you'll be <radical>building</radical> in <radical>prison</radical> is one made of <kanji>pottery</kanji>. Do you honestly think they would let you have anything made of metal or plastic? No, too dangerous. You have to make all of your cans and plates and underpants the old-fashioned pottery way.","meaning_hint":"Picture the first piece of pottery you ever made. Feel it in your hands. At least you've learned something new while you've been stuck in prison.","reading_mnemonic":"You get so good at <kanji>pottery</kanji> that the guards start to notice and offer to sell what you make in <reading>とう</reading>きょう. とうきょう is a big pottery town, after all. You'll make a fortune! Well... the guards will at least.","reading_hint":"Selling your prison pottery in とうきょう might even help you get out faster. Yippee!","vocabulary":[{"word":"陶器","level":49,"meaning":"Pottery","reading":"とうき"},{"word":"陶芸","level":49,"meaning":"Ceramic Art","reading":"とうげい"},{"word":"鬱陶しい","level":50,"meaning":"Gloomy","reading":"うっとうしい"}]},{"id":2071,"level":49,"kanji":"隔","onyomi":[{"reading":"かく","primary":true,"accepted_answer":true,"type":"onyomi"}],"kunyomi":[{"reading":"へだ","primary":false,"accepted_answer":false,"type":"kunyomi"}],"meanings":[{"meaning":"Isolate","primary":true,"accepted_answer":true}],"meaning_mnemonic":"A <radical>building</radical> that has a <radical>bully</radical> will <kanji>isolate</kanji> itself. Building have feelings like people, you know.","meaning_hint":"Picture a single building, isolated from the rest of the city and those mean, bully buildings that live there.","reading_mnemonic":"The <kanji>isolate</kanji>d building only has one companion, and it's the <reading>cock</reading> (かく) that lives inside of it.","reading_hint":"Picture the sun rising behind an isolated building. A cock lets out a cry from the roof. It's a sad and lonely scene.","vocabulary":[{"word":"隔離","level":49,"meaning":"Isolation","reading":"かくり"},{"word":"隔週","level":49,"meaning":"Every Other Week","reading":"かくしゅう"},{"word":"間隔","level":49,"meaning":"Space","reading":"かんかく"},{"word":"隔月","level":49,"meaning":"Every Other Month","reading":"かくげつ"},{"word":"隔てる","level":49,"meaning":"To Isolate","reading":"へだてる"}]},{"id":2050,"level":49,"kanji":"駒","onyomi":[{"reading":"く","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"こま","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Chess Piece","primary":true,"accepted_answer":true}],"meaning_mnemonic":"The <radical>horse</radical> who can write a <radical>paragraph</radical> gets to be a <kanji>chess piece</kanji>. Only the most erudite of horses gets selected to be a chess piece. The knight’s chess piece is represented by a horse, and for a horse to earn this honor, they must first write a paragraph explaining why they deserve the honor.","meaning_hint":"Imagine a horse trying to write a paragraph about why it deserves to be a chess piece. See the horse struggle with his hooves to write out a paragraph as he neighs in nervous frustration.","reading_mnemonic":"Upon being told that he will never be a <kanji>chess piece</kanji>, the horse slips into a <reading>coma</reading> (こま). The horse will never awaken from this coma as he knows he will never fulfill his dream of becoming a chess piece, so he has nothing to live for.","reading_hint":"See this horse in its coma. You feel bad that it will never be able to be a chess piece, but this is a bit dramatic.","vocabulary":[]},{"id":2058,"level":49,"kanji":"鶴","onyomi":[{"reading":"かく","primary":false,"accepted_answer":false,"type":"onyomi"}],"kunyomi":[{"reading":"つる","primary":true,"accepted_answer":true,"type":"kunyomi"}],"meanings":[{"meaning":"Crane","primary":true,"accepted_answer":true}],"meaning_mnemonic":"On the <radical>roof</radical> there's some type of <radical>turkey</radical> <radical>bird</radical>, but thinner and longer. You look closer and realize it's a <kanji>crane</kanji>.","meaning_hint":"Picture the beautiful black and white crane dancing gracefully on the roof. Now that you know what it is, you feel a little bad about calling it a turkey bird.","reading_mnemonic":"The <kanji>crane</kanji> leans down toward you from its roof perch and squawks, \"<reading>Too ru</reading>de (つる)!\" You're shocked! You didn't know the crane could speak English, but even worse, it knew you called it a turkey bird.","reading_hint":"The crane keeps saying you're too rude whenever other people come close so they know what kind of person you are. Yikes, you really shouldn't have gotten on this crane's bad side.","vocabulary":[]}]